#+title: *orgからLaTeXやHTMLへのエクスポート自分用メモ*
#+AUTHOR: sugayu
#+LATEX_CLASS: jsarticle
#+LATEX_HEADER: \newcommand{\NaID}{\mbox{Na\,{\sc i}\,D}}
#+OPTIONS: toc:nil
# # 章番号を消す
# #+OPTIONS: num:0

** コード
~org-babel~ を使ってPythonコードが挿入できる。
デフォルトではLaTeXに出力したときソースコードは全て ~verbatim~ で囲まれている。
そのためソースコードに装飾を施すためには工夫が必要になる。
- [[https://orgmode.org/manual/Exporting-Code-Blocks.html][Exporting Code Blocks (The Org Manual)]]
- [[https://orgmode.org/manual/Results-of-Evaluation.html][Results of Evaluation (The Org Manual)]]

ソースコードをハイライトするパッケージとして ~minted~ が使える。
以下のコマンドで ~minted~ を使うことができる。
#+begin_src emacs-lisp
  (setq org-latex-listings 'minted)
#+end_src
~org-latex-minted-options~ で ~minted~ 用の設定を記述することができる。
また ~\usepackage{minted}~ を設定する必要がある。
- [[https://qiita.com/clothoid/items/0a8f825ae19150fe5750][emacs の org-latex-export-to-pdf 設定手順 #Python - Qiita]]

コードを書いたときのアウトプットは ~:exports~ 設定に依る。
デフォルトの ~:exports~ は ~code~ なので、Pythonコードは ~python~ 環境のときはコードがそのまま表示される。
#+begin_src python
  import numpy as np
  a = np.arange(10)
  print(a)
#+end_src

~ob-ipython~ でも同様で、結果を実行していたとしても ~:exports code~ の場合は実行されない。
#+begin_src ipython :session :exports code :results raw drawer
  import numpy as np
  np.arange(10)
#+end_src

#+RESULTS:
:results:
# Out[2]:
: array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
:end:

このとき ~ob-ipython~ を使って計算結果を走らせていたとしても、 ~:results~ に ~drawer~ が入っていると表示されないので注意する。
#+begin_src ipython :session :exports code :results raw
  import numpy as np
  np.arange(10)
#+end_src

#+RESULTS:
# Out[3]:
: array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

出力パラメータが ~:exports results~ の場合にはコードが走った結果のみが表示される。
~:exports both~ の場合にはコードと出力が表示される。
~:results raw~ で ~org~ 上で出力していると、出力先には2重で表示されるので注意する。

また、あたりまえだが、LaTeXやHTMLに出力するたびにコードが走るので動作が非常に遅くなって効率が悪い。
度々走らせる必要があるコード以外は先に出力しておいてそれを表示するだけの方が良い。
~:eval never-export~ を設定するとエクスポート時に実行されなくなる。

#+begin_src ipython :session :exports results :results raw :eval never-export
  import numpy as np
  np.arange(10)
#+end_src
